---
kind: method
id: M:Autodesk.Revit.DB.FormArray.GetEnumerator
source: html/baf60ab2-6e02-06b4-b82d-fda3df6843c1.htm
---
# Autodesk.Revit.DB.FormArray.GetEnumerator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the array.